In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("titanic.csv")
df.head()

,first_name,family_name,type,ticket_number,pclass,departure,price,survived,lifeboat,body_no,...,gender,age,marital_status,number_relatives_onboard,home_location,destination,age_at_death,occupation,department,works_for
0,Luka,Orešković,Passenger,315094.0,3rd Class Passengers,Southampton,8.0,False,NaN,NaN,...,Male,20.0,Married,3,"Konjsko Brdo, Croatia [Austria-Hungary]","Chicago, Illinois, United States",20.0,Farmer,NaN,NaN
1,Joseph Francis,Akerman,Crew,NaN,NaN,Southampton,NaN,False,NaN,NaN,...,Male,37.0,Married,1,"Southampton, Hampshire, England",NaN,37.0,Assistant Pantryman Steward,Victualling Crew,White Star Line
2,Mary Elizabeth,Davison,Passenger,386525.0,3rd Class Passengers,Southampton,16.0,True,boat 10,NaN,...,Female,34.0,Married,2,"Liverpool, Lancashire, England","Bedford, Ohio, United States",61.0,NaN,NaN,NaN
3,Ernest Edward Samuel,Freeman,Crew,NaN,NaN,Belfast,NaN,False,NaN,NaN,...,Male,45.0,Married,1,"Southampton, Hampshire, England",NaN,NaN,Deck Steward (1st Class),Victualling Crew,White Star Line
4,George Alfred,Levett,Crew,NaN,NaN,Belfast,NaN,False,NaN,NaN,...,Male,25.0,Married,2,"Southampton, Hampshire, England",NaN,25.0,Assistant Pantryman Steward (1st Class),Victualling Crew,White Star Line